import 'package:flutter_task/models/user_model.dart';

import '../models/rating_model.dart';
import '../models/status_model.dart';

class FakeDataSource{
static List<RatingModel> merchantRatingList = [
  RatingModel(UserModel("assets/images/user1.png", "يوسف محمود"), 5, "10 - 10 - 2022", "هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف", false),
  RatingModel(UserModel("assets/images/user2.png", "خالد طايع"), 4, "9 - 10 - 2022", "هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف", true),
  RatingModel(UserModel("assets/images/user3.png", "جابر حسن"), 4, "10 - 10 - 2022", "هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف", true),
];


static List<StatusModel> statusList = [
  StatusModel("F6027998605", "خالد طايع", "ميدان صلاح الدين شارع المنشيه", 280.00),
  StatusModel("F6052478963", "يوسف محمود", "شارع التلفزيون شارع الطيب", 280.00),
  StatusModel("F6027998605", "خالد طايع", "ميدان صلاح الدين شارع المنشيه", 280.00),
];




}